<script lang="ts" setup>

</script>

<template>
  <div>
    <ul class="ml-4 list-circle">
      <li>Если не работает открытие канала при наборе номера, и вверху браузера пишется "Всплывающее окно заблокировано", нажмите на эту надпись/иконку и разрешите всплывающие окна для этого сайта. Перезагрузите страницу и все должно заработать</li>
      <li>Чтобы обновить список доступных каналов, в коде сайта в `src/shared/index.ts` в `channelsPacks` в список `basic` надо добавить номера новых каналов. Там же можно удалить старые.</li>
    </ul>
  </div>
</template>

<style scoped>

</style>
