export const channelsMock = {
  channels: [
    {
      id: '52d555c99109550984000006',
      title: 'Авто Плюс HD',
      keyNumber: 736,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzL2F1dG8tcGx1cy5wbmc=',
      relevantGenres: [
        { genreId: 'hd-channels', relevance: 1000 },
        { genreId: 'entertainment', relevance: 999 },
        { genreId: 'auto', relevance: 998 },
      ],
      description:
        'Приобщить зрителей к высокой автомобильной культуре обещает телеканал «Авто Плюс». Канал круглосуточно вещает об автомобилях и моторных видах спорта. Смотрите «Авто Плюс», став абонентом онлайн-сервиса «Смотрёшка».\r\n######Эфирное наполнение «Авто Плюс»\r\nРазвлекательно-познавательный канал с момента начала вещания в 2006 году удерживает лидирующие позиции среди российских автомобильных телеканалов, предлагая зрителю много интересных программ:\r\n- тест-драйвы новых авто;\r\n- обзоры мировых гоночных серий;\r\n- автомобильные путешествия;\r\n- реалити-шоу;\r\n- репортажи с мировых автосалонов;\r\n- острые дискуссии на автомобильные темы;\r\n- новости автомобильного мира и др.\r\nЭфир «Авто Плюс» состоит из передач собственного производства и специально отобранных российских и зарубежных программ. Ежедневные новости со всех уголков планеты, документальные фильмы о мировых автобрендах, сравнительные тесты подержанных авто, мнения экспертов, тематические сериалы — все это и многое другое можно смотреть на «Авто Плюс» круглосуточно.\r\nТелеканал — многократный победитель и лауреат телевизионных премий «Большая цифра» и «Золотой луч».\r\n######«Авто Плюс» онлайн в тарифах ТВ-платформы «Смотрёшка»\r\nАбонентам «Смотрёшки» доступны «Авто Плюс» и сотни других каналов в превосходном качестве с любого устройства, имеющего выход в интернет. Тарифы представляют собой комбинацию ТВ и кинотеатров. Подписчикам всегда есть что посмотреть, к тому же можно управлять просмотром:\r\n- ставить эфир на паузу и перематывать;\r\n- возвращаться к программе из архива за 14 дней;\r\n- ставить напоминание о предстоящей трансляции;\r\n- продолжать начатый и поставленный на паузу просмотр с другого устройства.\r\nПодключайте всю семью к одному аккаунту (одновременно 5 устройств) и смотрите легальные передачи, фильмы и сериалы дома или в дороге. В рамках одного приложения доступно более 300 каналов и 6 онлайн-кинотеатров.',
      dvrDepthLimitHours: 110,
    },
    {
      id: '52d555c9910955098400000c',
      title: 'Петербург – 5 канал',
      keyNumber: 5,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzLzVfa2FuYWxfOTA5MzEucG5n',
      relevantGenres: [{ genreId: 'federal', relevance: 1000 }],
      description: '',
      dvrDepthLimitHours: 168,
    },
    {
      id: '52d555c9910955098400000d',
      title: 'Россия 1',
      keyNumber: 2,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzL3Jvc3NpYTEucG5n',
      relevantGenres: [
        { genreId: 'federal', relevance: 1000 },
        { genreId: 'russian', relevance: 999 },
      ],
      description:
        'В эфир телеканала «Россия-1» выходят информационные, аналитические и развлекательные передачи, ток-шоу, отечественные сериалы. Зрителей ждут прямые эфиры с кинофестивалей и других мероприятий. Посмеяться от души за просмотром юмористических шоу, удивиться происходящему в мире, слушая новости, поломать голову на интеллектуальных передачах, погрузиться в водоворот событий в любимом сериале — все это можно сделать на телеканале «Россия-1».\r\nСтановитесь абонентом «Смотрёшки» и смотрите «Россию-1» и еще более трехсот каналов онлайн и на ТВ.',
      dvrDepthLimitHours: 96,
    },
    {
      id: '5326c46585bbf8011b000704',
      title: 'РБК ТВ HD',
      keyNumber: 62,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzL3Jiay5wbmc=',
      relevantGenres: [
        { genreId: 'hd-channels', relevance: 1000 },
        { genreId: 'news', relevance: 999 },
      ],
      description:
        'В эфир канала «РБК HD» каждые полчаса выходят выпуски новостей о событиях в России и за рубежом в сфере политики, экономики, бизнеса. Из аналитических программ зрители узнают мнение ведущих представителей бизнеса и власти по самым актуальным вопросам. Состояние финансовых рынков, тренды в разных областях, расследования — обо всем этом на канале. Внимание уделяется и развлекательным передачам: смотрите на РБК о спорте, автомобилях, путешествиях в HD-качестве. Телеканал доступен в приложении «Смотрёшка».',
      dvrDepthLimitHours: 110,
    },
    {
      id: '535e41fbebf8c403a10014e4',
      title: 'Феникс плюс кино HD',
      keyNumber: 184,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzL2Zlbml4X3BsdXNfa2lub19oZC5wbmc=',
      relevantGenres: [
        { genreId: 'hd-channels', relevance: 1000 },
        { genreId: 'movies', relevance: 999 },
      ],
      description:
        'Канал «ФЕНИКС плюс КИНО» открывает доступ к российским фильмам и сериалам, с успехом прошедшим в прайм-тайм на федеральных телеканалах и полюбившимся миллионам зрителей. Основу сетки вещания составляют сериальная продукция известных кинокомпаний («Татьянин день», «Брак по завещанию», «Улыбка пересмешника» и др.), кинодетективы по произведениям Татьяны Устиновой.\r\n«ФЕНИКС плюс КИНО» охватывает разные жанры: мелодрамы и драмы, детективы, боевики, приключенческие сериалы. Все серии, узнаваемые герои и близкие простому человеку истории. Сюжеты хоть и знакомы, от этого не менее интересно наблюдать за их развитием.\r\nОформляйте подписку «Смотрёшки» и смотрите сериалы нон-стоп онлайн или на ТВ, управляйте просмотром с помощью интерактивных опций, таких как пауза, перемотка, смена устройства, архив. Кроме «ФЕНИКС плюс КИНО», на платформе доступны еще 370+ каналов и онлайн-кинотеатры. К одному аккаунту доступен просмотр на 5 устройствах.',
      dvrDepthLimitHours: 110,
    },
    {
      id: '535f3a74ebf8c403a10017c5',
      title: 'Живи! HD',
      keyNumber: 727,
      logoUrl:
        'http://smotreshka.server-img.lfstrm.tv/image/aHR0cDovL2ltZy5iNjEyLnRpZ2h0dmlkZW8uY29tL2NoYW5uZWxzL2ppdmkucG5n',
      relevantGenres: [
        { genreId: 'hd-channels', relevance: 1000 },
        { genreId: 'knowledge', relevance: 999 },
      ],
      description:
        'Аудитория телеканала «Живи!» — это активные, целеустремленные и позитивные женщины и мужчины, которые предпочитают даже перед телевизором проводить время с пользой, выполняя фитнес-программу или занимаясь йогой.\r\nЭфирное наполнение канала «Живи!» как нельзя лучше отражает девиз «Движение — это жизнь». Йога, аэробика, гимнастика, кроссфит, дыхательные практики, танцы под руководством опытных инструкторов заставляют по-настоящему почувствовать себя живым. А результат от тренировок в виде подтянутого тела, здоровой спины и психоэмоционального равновесия не заставит себя долго ждать.\r\nПодключайте приложение «Смотрёшка» и смотрите «Живи!» онлайн и на ТВ вместе с сотнями других каналов.',
      dvrDepthLimitHours: 110,
    },
  ],
  genres: [
    { id: 'movies', title: 'Кино', iconId: 'tv_genre_icon_movies' },
    { id: 'kids', title: 'Детские', iconId: 'tv_genre_icon_kids' },
    { id: 'sports', title: 'Спорт', iconId: 'tv_genre_icon_sports' },
    { id: '4k', title: '4К-каналы', iconId: 'tv_genre_icon_4k' },
    {
      id: 'hd-channels',
      title: 'HD-каналы',
      iconId: 'tv_genre_icon_hd_channels',
    },
    {
      id: 'entertainment',
      title: 'Развлекательные',
      iconId: 'tv_genre_icon_entertainment',
    },
    {
      id: 'knowledge',
      title: 'Познавательные',
      iconId: 'tv_genre_icon_knowledge',
    },
    { id: 'news', title: 'Новостные', iconId: 'tv_genre_icon_news' },
    { id: 'music', title: 'Музыкальные', iconId: 'tv_genre_icon_music' },
    { id: 'animal', title: 'Про животных', iconId: 'tv_genre_icon_animal' },
    { id: 'cooking', title: 'Кулинарные', iconId: 'tv_genre_icon_cooking' },
    { id: 'auto', title: 'Автомобильные', iconId: 'tv_genre_icon_auto' },
    { id: 'fashion', title: 'Мода', iconId: 'tv_genre_icon_fashion' },
    {
      id: 'russian',
      title: 'Российские ТВ-каналы',
      iconId: 'tv_genre_icon_russian',
    },
    { id: 'regional', title: 'Региональные', iconId: 'tv_genre_icon_regional' },
    { id: 'science', title: 'Научные', iconId: 'tv_genre_icon_science' },
    { id: 'federal', title: 'Федеральные', iconId: 'tv_genre_icon_federal' },
    { id: 'serial', title: 'Сериальные', iconId: 'tv_genre_icon_serial' },
    {
      id: 'featured',
      title: 'Стоит посмотреть',
      iconId: 'tv_genre_icon_featured',
    },
    { id: 'soviet', title: 'Советские', iconId: 'tv_genre_icon_soviet' },
  ],
  regularUpdate: {
    intervalSec: 1800,
    etag: '563eaa87d981b60bcf05b4e391a4365b',
  },
}
